FV2304/E_0400.dot
digraph D {
    labelloc="t";
    label=<<B><FONT POINT-SIZE="18">Dummy Chapter</FONT></B><BR/><BR/><B><FONT POINT-SIZE="16">Dummy Subchapter</FONT></B><BR/><BR/><BR/><BR/>>;
    "Start" [margin="0.2,0.12", shape=box, style=filled, fillcolor="#7a8da1", label=<<B>E_0400</B><BR align="center"/><FONT point-size="12"><B><U>Prüfende Rolle:</U> LF</B></FONT><BR align="center"/>>];
    "1" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>1: </B>Liegt der übermittelte Kündigungstermin vor dem Nachrichteneingang?<BR align="left"/>>];
    "A12" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cca9ab", label=<<B>A12</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Fristüberschreitung<BR align="left"/></FONT>>];
    "2" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>2: </B>Ist in der Kündigung die Angabe der Identifikationslogik mit dem Wert „Marktlokations-ID“ angegeben?<BR align="left"/>>];
    "3" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>3: </B>Wurde mit der in der Kündigung angegebenen ID der Marktlokation im IT-System des Empfängers eine Marktlokation identifiziert, welcher der Empfänger für mindestens einen Tag zugeordnet war bzw. ist bzw. sein wird?<BR align="left"/>>];
    "A01" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cca9ab", label=<<B>A01</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Die Marktlokation ist nicht identifizierbar.<BR align="left"/></FONT>>];
    "4" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>4: </B>Wurde mit allen zur Verfügung gestellten Informationen in der Kündigung ohne Berücksichtigung des Kundennamens unter Wahrung der gebotenen Sorgfalt genau eine Marktlokation ermittelt?<BR align="left"/>>];
    "5" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>5: </B>Entspricht der Kunde aus der Kündigung dem Vertragspartner beim Empfänger der Kündigung? (Identifizierung unter Wahrung der gebotenen Sorgfalt)<BR align="left"/>>];
    "A02" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cca9ab", label=<<B>A02</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Angefragter Kunde ist nicht der Vertragspartner beim LFA.<BR align="left"/></FONT>>];
    "6" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>6: </B>Wurde mit den zur Verfügung gestellten Informationen in der Kündigung mehr als eine Marktlokation ermittelt?<BR align="left"/>>];
    "A03" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cca9ab", label=<<B>A03</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Keine Identifizierung einer Marktlokation.<BR align="left"/></FONT>>];
    "7" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>7: </B>Entspricht der Kunde aus der Kündigung bei exakt einer Marktlokation, dem Vertragspartner beim Empfänger der Kündigung, mit welchem der LFA zum Kündigungsdatum einen Vertrag hat? <BR align="left"/>(Identifizierung unter Wahrung der gebotenen Sorgfalt)<BR align="left"/>>];
    "A04" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cca9ab", label=<<B>A04</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Mehrere Marktlokationen wurden identifiziert, Kunde war bei keiner bzw. mehreren Marktlokationen zugeordnet.<BR align="left"/></FONT>>];
    "8" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>8: </B>Handelt es sich bei dem identifizierten Objekt um einen Teil einer Kundenanlage, welches zum Kündigungsdatum + 1 Tag nicht an der Marktkommunikation teilnimmt? <BR align="left"/>(Teil einer Kundenanlage, welche dem NB nicht bekannt ist.)<BR align="left"/>>];
    "A05" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cca9ab", label=<<B>A05</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Teil einer Kundenanlage, die derzeit nicht se-parat bilanziert wird.<BR align="left"/></FONT>>];
    "9" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>9: </B>Liegt der in der Kündigung angefragte Termin vor dem Beginn des Vertrages zwischen dem Kunden und dem Empfänger?<BR align="left"/>>];
    "A13" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cca9ab", label=<<B>A13</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Empfänger ist zum angefragten Zeitpunkt nicht zugeordnet.<BR align="left"/></FONT>>];
    "10" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>10: </B>Wurde der Vertrag bereits zu dem angefragten Kündigungstermin gekündigt?<BR align="left"/>>];
    "A06" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cca9ab", label=<<B>A06</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Zustimmung<BR align="left"/>Vertrag wurde bereits zum angefragten Kündigungstermin gekündigt.<BR align="left"/></FONT>>];
    "11" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>11: </B>Wurde der Vertrag bereits zu einem Datum vor dem angefragten Kündigungstermin gekündigt?<BR align="left"/>>];
    "A07" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cca9ab", label=<<B>A07</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Zum Kündigungstermin besteht kein Vertrags-verhältnis mehr.<BR align="left"/></FONT>>];
    "12" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>12: </B>Handelt es sich um eine Kündigung, welche zu einem fixen Termin ausgesprochen wurde?<BR align="left"/>>];
    "A11" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cca9ab", label=<<B>A11</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Zustimmung<BR align="left"/>Zustimmung<BR align="left"/></FONT>>];
    "13" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>13: </B>Ist der Vertrag zum übermittelten Kündigungstermin unter Einhaltung der Kündigungsfrist unter Berücksichtigung des Eingangsdatums der Kündigung kündbar?<BR align="left"/>>];
    "14" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>14: </B>Wurde der Vertrag bereits zu einem späteren Zeitpunkt beendet?<BR align="left"/>>];
    "A08" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cca9ab", label=<<B>A08</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Vertragsbindung bei bereits in der Zukunft beendetem Vertrag.<BR align="left"/></FONT>>];
    "A09" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cca9ab", label=<<B>A09</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Vertragsbindung<BR align="left"/></FONT>>];

    "Start" -> "1";
    "1" -> "A12" [label="Ja"];
    "1" -> "2" [label="Nein"];
    "2" -> "3" [label="Ja"];
    "2" -> "4" [label="Nein"];
    "3" -> "A01" [label="Nein"];
    "3" -> "9" [label="Ja"];
    "4" -> "6" [label="Nein"];
    "4" -> "5" [label="Ja"];
    "5" -> "A02" [label="Nein"];
    "5" -> "8" [label="Ja"];
    "6" -> "A03" [label="Nein"];
    "6" -> "7" [label="Ja"];
    "7" -> "A04" [label="Nein"];
    "7" -> "8" [label="Ja"];
    "8" -> "A05" [label="Ja"];
    "8" -> "9" [label="Nein"];
    "9" -> "A13" [label="Ja"];
    "9" -> "10" [label="Nein"];
    "10" -> "A06" [label="Ja"];
    "10" -> "11" [label="Nein"];
    "11" -> "A07" [label="Ja"];
    "11" -> "12" [label="Nein"];
    "12" -> "13" [label="Ja"];
    "12" -> "A11" [label="Nein"];
    "13" -> "A11" [label="Ja"];
    "13" -> "14" [label="Nein"];
    "14" -> "A08" [label="Ja"];
    "14" -> "A09" [label="Nein"];
}
